app/views/sliders/_form.html.erb

    <%= f.label :product, 'Link this Image to a Product' %><br />
  	<%= f.select :product_id, Product.active.collect {|p|[p.title, p.id]},{:include_blank => 'None'} %>
---
SELECT "products".* FROM "products" WHERE "products"."active" = 't'