app/controllers/categories_controller.rb

  def show
    @category = Category.where(:slug => params[:id]).first
    if current_user
      @products = @category.products.order('category_products.position').page params[:page]
    else
      @products = @category.products.active.order('category_products.position').page params[:page]
---
SELECT "categories".* FROM "categories" WHERE "categories"."slug" = 'case-furniture' LIMIT 1
SELECT "categories".* FROM "categories" WHERE "categories"."active" = 't' ORDER BY position

  def edit
    @category = Category.where(:slug => params[:id]).first
---
SELECT "categories".* FROM "categories" WHERE "categories"."slug" = 'lighting' LIMIT 1

  def create
    @category = Category.new(params[:category])

    respond_to do |format|
      if @category.save
---
INSERT INTO "categories" ("active", "created_at", "description", "position", "slug", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    @category = Category.where(:slug => params[:id]).first
    respond_to do |format|
      if @category.update_attributes(params[:category])
---
SELECT "categories".* FROM "categories" WHERE "categories"."slug" = 'case-furniture' LIMIT 1
UPDATE "categories" SET "position" = 4, "updated_at" = '2011-11-05 12:10:43.587586' WHERE "categories"."id" = 7

  def sort
    params[:CategoriesOrder].each_with_index do |id, index|
      Category.where(:id => id.scan(/\d+/)).update_all(:position => index+1)
---
UPDATE "categories" SET "position" = 1 WHERE "categories"."id" IN (NULL)

  def toggle
    @category = Category.where(:slug => params[:id]).first
    @category.toggle_active
---
SELECT "categories".* FROM "categories" WHERE "categories"."slug" = 'fine-art--sculpture' LIMIT 1
UPDATE "categories" SET "active" = 'f', "updated_at" = '2011-11-05 13:48:39.891008' WHERE "categories"."id" = 8