app/controllers/categories_controller.rb

SELECT "categories".* FROM "categories" WHERE "categories"."active" = 't' ORDER BY position
---
  def index
    @inactive_categories = Category.inactive.order(:position)