app/controllers/home_controller.rb

  def index
    @sliders = Slider.active.order(:position)
---
SELECT "sliders".* FROM "sliders" WHERE "sliders"."active" = 't' ORDER BY position

  def phoebes_finds
    @products = Product.phoebe_finds.active.order(:position).page params[:page]
---
SELECT "products".* FROM "products" WHERE "products"."phoebe_find" = 't' ORDER BY position
SELECT COUNT(*) FROM "products" WHERE "products"."phoebe_find" = 't'