app/controllers/images_controller.rb

  def index
    @product = Product.find(params[:product_id])
    @images = @product.images.all
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", "15-tatums-thing"]]
SELECT "images".* FROM "images" WHERE "images"."product_id" = 15

  def create
    @product = Product.find(params[:product_id])
    @image = @product.images.build(params[:image])

    respond_to do |format|
      if @image.save
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", "15-tatums-thing"]]
INSERT INTO "images" ("created_at", "image", "product_id", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Sat, 29 Oct 2011 10:49:39 CDT -05:00], ["image", "02259_cloakofnight_1280x800.jpg"], ["product_id", 15], ["updated_at", Sat, 29 Oct 2011 10:49:39 CDT -05:00]]