app/controllers/measurements_controller.rb

  def index
    @product = Product.find(params[:product_id])
    @measurements = @product.measurements.order(:position)
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", "15-tatums-thing"]]
SELECT "measurements".* FROM "measurements" WHERE "measurements"."product_id" = 15 ORDER BY position

  def create
    @product = Product.find(params[:product_id])
    @measurements = @product.measurements.order(:position)

    @measurement = @product.measurements.build(params[:measurement])

    respond_to do |format|
      if @measurement.save
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", "15-tatums-thing"]]
SELECT "measurements".* FROM "measurements" WHERE "measurements"."product_id" = 15 ORDER BY position
INSERT INTO "measurements" ("amount", "created_at", "dimension", "position", "product_id", "unit_of_measure", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def edit
    @measurement = Measurement.find(params[:id])
---
SELECT "measurements".* FROM "measurements" WHERE "measurements"."id" = ? LIMIT 1  [["id", "9"]]

  def update
    @measurement = Measurement.find(params[:id])
    respond_to do |format|
      if @measurement.update_attributes(params[:measurement])
---
SELECT "measurements".* FROM "measurements" WHERE "measurements"."id" = ? LIMIT 1  [["id", "9"]]
UPDATE "measurements" SET "amount" = '120', "unit_of_measure" = '"', "updated_at" = '2011-10-29 15:57:55.569894' WHERE "measurements"."id" = 9

  def sort
    params[:MeasurementsOrder].each_with_index do |id, index|
      Measurement.where(:id => id.scan(/\d+/)).update_all(:position => index+1)
---
UPDATE "measurements" SET "position" = 1 WHERE "measurements"."id" IN (1, 0)