app/controllers/products_controller.rb

  def index
<<<<<<< HEAD
    @products = Product.all
---
SELECT "products".* FROM "products" ORDER BY position

  def create
    @product = Product.new(params[:product])
    @product_categories = @product.category_ids

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("active", "body", "country", "created_at", "image", "item_number", "new_acquisition", "period", "phoebe_find", "position", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    params[:product][:category_ids] ||= []
    @product = Product.find(params[:id])
    @product_categories = @product.category_ids

    respond_to do |format|
      if @product.update_attributes(params[:product])
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", "15-tatums-thing"]]
UPDATE "products" SET "body" = '<p>These charming paintings of domestic scenes, riverscapes and pavilions amidst trees, lakeside scenes with mountains in the background, courtly figures with their attendants and servants, contained in their original English papier mache frames retaining their original white painted decoration with parcel oil gilding, the inner guilloche mouldings within pierced borders edged with joined “C” scrolls

  def sort
    params[:ProductsOrder].each_with_index do |id, index|
<<<<<<< HEAD
      Product.where(:id => id.scan(/\d+/)).update_all(:position => index+1)
---
UPDATE "products" SET "position" = 1 WHERE "products"."id" IN (1, 5)