app/controllers/sliders_controller.rb

  def show
    @slider = Slider.find(params[:id])
---
SELECT "sliders".* FROM "sliders" WHERE "sliders"."id" = ? LIMIT 1  [["id", "10"]]

  def edit
    @slider = Slider.find(params[:id])
---
SELECT "sliders".* FROM "sliders" WHERE "sliders"."id" = ? LIMIT 1  [["id", "9"]]

  def create
    @slider = Slider.new(params[:slider])

    respond_to do |format|
      if @slider.save
---
INSERT INTO "sliders" ("active", "created_at", "image", "position", "product_id", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def update
    @slider = Slider.find(params[:id])

    respond_to do |format|
      if @slider.update_attributes(params[:slider])
---
SELECT "sliders".* FROM "sliders" WHERE "sliders"."id" = ? LIMIT 1  [["id", "9"]]
UPDATE "sliders" SET "image" = '01848_flow_1680x1050.jpg', "updated_at" = '2011-10-29 16:36:26.089230' WHERE "sliders"."id" = 9

  def sort
    params[:SlidersOrder].each_with_index do |id, index|
      Slider.where(:id => id.scan(/\d+/)).update_all(:position => index+1)
---
UPDATE "sliders" SET "position" = 1 WHERE "sliders"."id" IN (1, 0)

  def toggle
    @slider = Slider.find(params[:id])
    @slider.toggle_active
---
SELECT "sliders".* FROM "sliders" WHERE "sliders"."id" = ? LIMIT 1  [["id", "10"]]
UPDATE "sliders" SET "active" = 't', "updated_at" = '2011-10-29 16:36:40.585748' WHERE "sliders"."id" = 10