app/views/categories/index.html.erb

<script language="javascript">
	$(document).ready(function(){
		$('#categories').sortable({
			update: function(event, ui) {
				var CategoriesOrder = $(this).sortable('toArray');
				$.post( 'categories/sort', {CategoriesOrder:CategoriesOrder});


				// TO DO RELOAD THE SIDEBAR A
        // $('#categories').load('_sidebar.html.erb', function() {
        //         alert('Load was performed.');
        // });
			}
		});
	});
---
SELECT "categories".* FROM "categories"