app/views/categories/show.html.erb

                <li class="small-thumbs">
                  <% category_product.product.images.each do |image| %>
---
SELECT "products".* FROM "products" WHERE "products"."id" = 14 LIMIT 1