app/views/products/_form.html.erb

  <div class="checkbox-line">
    <% Category.active.each do |category| %>
---
SELECT "categories".* FROM "categories" WHERE "categories"."active" = 't'