app/views/products/show.html.erb

SELECT "images".* FROM "images" WHERE "images"."product_id" = 14
---
<script>
$(function () {
    $('#fileupload').fileupload({
        dataType: 'json',
        url: '<%= product_images_path(@product.id) %>',
        done: function (e, data) {
            $.each(data.result, function (index, response) {


              console.log(response)
                //$('#thumbs').html(object.name).appendTo(document.body);
                //console.log("<%= escape_javascript( @image ) %>")
                //$('#additional-images').html("<%= escape_javascript(render @product.images ) %>")
                //console.log(file);

                // <li id="image_134">
                //   <a href="/uploads/image/image/134/large_01848_flow_1680x1050.jpg" class="single_image">
                //     <img alt="Thumb_200_01848_flow_1680x1050" src="/uploads/image/image/134/thumb_200_01848_flow_1680x1050.jpg">
                //   </a>
                //   <a href="/images/134" class="delete-image white small button no-print" data-confirm="Are you sure?" data-method="delete" data-remote="true" rel="nofollow">X
                //   </a>
                // </li>