app/views/layouts/_sidebar.html.erb

SELECT "categories".* FROM "categories" WHERE "categories"."active" = 't' ORDER BY position
---
<% Category.active.each do |category|%>